print(3.41)
print('-'*10)
print('%07d %f' % (3.41,3.41))


# print('%d 여기의 들어가 있는 문구는 그대로 출력,,, %d' % (5,10))

# print('%d + %d = %d' %(10,5,10+5))

# # 1 * 1 = 1
# print('%d * %d = %d' %(1,1,1*1))
# print('%d * %d = %d' %(1,2,1*2))
# print('%d * %d = %d' %(1,3,1*3))
# print('%d * %d = %d' %(1,4,1*4))
# print('%d * %d = %d' %(1,5,1*5))
# # 1 * 2 = 2
# # 1 * 3 = 3
# # 1 * 4 = 4
# # 1 * 5 = 5


# # print함수설명 : 화면에 출력이 됨.
# # print('문자를 출력할수 있습니다.')

# # print(100+100)
# # print(100-50)

# # print('100'+'50')
# # print('100',50)

# # print((100+5)*2)


